pmo-dataset/variations/graphviz_with_ids/28.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Register for\ninternship"];
  "User_2" [label="Enter topic"];
  "User_3" [label="Enter expected\nincome"];
  "User_4" [label="Enter experience"];
  "User_5" [label="Enter hobbies"];
  "User_6" [label="Accept offer"];
  "User_7" [label="Deny offer"];
  "User_8" [label="Publish your\napplication"];
  "User_9" [label="Begin internship"];
  "User_10" [label="Write at least 3\nstatus updates every\nweek"];
  "User_11" [label="End internship"];
  "Service_1" [label="Recieve offer"];
  "Service_2" [label="Invalidate all other\noffers"];
  "Service_3" [label="Recommend company to\na list of friends\nvia twitter api"];
  "Service_4" [label="Recieve 3 status\nupdates from the\ncompany"];
  "StartNoneEvent_1" [shape=circle, label="Internship process\nis started"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Internship succesful"];
  "ExclusiveGateway_1" [shape=diamond, label="Accept offer?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="Recommend company?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];
  "InclusiveGateway_1" [shape=diamond, label="O"];
  "InclusiveGateway_2" [shape=diamond, label="O"];

  "StartNoneEvent_1" -> "User_1";
  "InclusiveGateway_1" -> "User_5";
  "User_5" -> "InclusiveGateway_2";
  "Service_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_2" -> "Service_1";
  "User_7" -> "ExclusiveGateway_2";
  "User_8" -> "ExclusiveGateway_2";
  "ParallelGateway_2" -> "User_6";
  "ParallelGateway_2" -> "Service_2";
  "User_6" -> "ParallelGateway_1";
  "Service_2" -> "ParallelGateway_1";
  "User_9" -> "ParallelGateway_3";
  "InclusiveGateway_1" -> "User_4";
  "InclusiveGateway_1" -> "User_3";
  "User_4" -> "InclusiveGateway_2";
  "User_3" -> "InclusiveGateway_2";
  "ParallelGateway_3" -> "User_10";
  "ParallelGateway_3" -> "Service_4";
  "Service_4" -> "ParallelGateway_4";
  "User_10" -> "ParallelGateway_4";
  "ExclusiveGateway_3" -> "Service_3" [label="Yes"];
  "ParallelGateway_1" -> "User_9";
  "User_11" -> "ExclusiveGateway_3";
  "User_1" -> "ParallelGateway_5";
  "ParallelGateway_4" -> "User_11";
  "ParallelGateway_5" -> "User_2";
  "InclusiveGateway_2" -> "ParallelGateway_6";
  "User_2" -> "ParallelGateway_6";
  "ParallelGateway_5" -> "InclusiveGateway_1";
  "ParallelGateway_6" -> "User_8";
  "ExclusiveGateway_1" -> "User_7" [label="No"];
  "ExclusiveGateway_1" -> "ParallelGateway_2" [label="Yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="No"];
  "ExclusiveGateway_4" -> "EndNoneEvent_1";
  "Service_3" -> "ExclusiveGateway_4";
}
